Tutorials-3.0.0/mixingChanngel-2-Central/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.61 0 0);

boundaryField
{
    walls
    {
        type            slip;
    }
    inlet1
    {
        type            fixedValue;
        value           uniform (1.0 0 0);
    }
    inlet2
    {
        type            fixedValue;
        value           uniform (3.0 0 0);
    }
    outlet
    {
//	type		advective;
//	rho		rho;
//	phi		rhoPhi;
//	value		$internalField;
//	lInf		1.0;
//	fieldInf	(0 0 0);
	type		zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
